# Библиотека Pandas

## Data Frame

In [1]:
import pandas as pd
import numpy as np

In [3]:
#создание DataFrame по столбцам с помощью словарей
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

## Фильтрация : filter, булевые векторы, lambda для фильтрации. Статистики по отфильтрованным данным

In [4]:
student_stats = pd.read_csv('StudentsPerformance.csv')

In [30]:
student_stats.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [26]:
student_stats.filter(like = 'score', axis = 1)

     math score  reading score  writing score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [6]:
student_stats['lunch'].unique()  # выведем уникальные значения в категориальном или порядковом признаке

array(['standard', 'free/reduced'], dtype=object)

In [31]:
student_stats[student_stats['lunch'] == 'standard'].mean()

math score       70.034109
reading score    71.654264
writing score    70.823256
dtype: float64

In [9]:
student_stats.loc[student_stats['gender'] == 'female', ['lunch']]

            lunch
0        standard
1        standard
2        standard
5        standard
6        standard
..            ...
993  free/reduced
995      standard
997  free/reduced
998      standard
999  free/reduced

[518 rows x 1 columns]

In [12]:
student_stats.loc[(student_stats['gender'] == 'female') &
     (student_stats['race/ethnicity'].isin(['group A', 
                                   'group B'])), 'lunch'].value_counts()  #Вместо кросстаба : корректный детальный запрос

standard        87
free/reduced    53
Name: lunch, dtype: int64

In [32]:
student_stats[student_stats['lunch'] == 'free/reduced'].mean()

math score       58.921127
reading score    64.653521
writing score    63.022535
dtype: float64

In [49]:
student_stats.groupby('lunch')[['math score', 'reading score', 'writing score']].agg([np.mean, np.std])  
#более честкий запрос на среднее и отклонение через группировку и аггрегацию

             math score            reading score            writing score  \
                   mean        std          mean        std          mean
lunch
free/reduced  58.921127  15.159956     64.653521  14.895339     63.022535
standard      70.034109  13.653501     71.654264  13.830602     70.823256


                    std
lunch
free/reduced  15.433823
standard      14.339487

In [34]:
student_stats[(student_stats["lunch"] == 'free/reduced') & 
              (student_stats["race/ethnicity"] == "group B")]["math score"].max() #просто пример множественного отбора

88

In [37]:
student_stats.filter(like = 'score', axis = 1).apply(np.min) # применили функцию к столбцам отфильтрованного датафрейма

math score        0
reading score    17
writing score    10
dtype: int64

In [38]:
student_stats[student_stats["gender"].apply(lambda x: x[0] == "f")].head() #apply lambda функцию для фильтрации

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

### Замена значений в столбце: map, replace

In [41]:
d = {"female": 'f', "male": 'm'}
student_stats["gender"] = student_stats["gender"].map(d)
student_stats.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,f,group B,bachelor's degree,standard,none,72,72,74
1,f,group C,some college,standard,completed,69,90,88
2,f,group B,master's degree,standard,none,90,95,93
3,m,group A,associate's degree,free/reduced,none,47,57,44
4,m,group C,some college,standard,none,76,78,75

In [42]:
di = {"f": 'fem', "m": 'mal'}
student_stats = student_stats.replace({"gender": di})
student_stats.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,fem,group B,bachelor's degree,standard,none,72,72,74
1,fem,group C,some college,standard,completed,69,90,88
2,fem,group B,master's degree,standard,none,90,95,93
3,mal,group A,associate's degree,free/reduced,none,47,57,44
4,mal,group C,some college,standard,none,76,78,75

### Добавление и удаление строк и столбцов : append, drop

In [ ]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}

In [ ]:
#добавление строки в DataFrame
frame.append(new_line, ignore_index=True)

In [ ]:
#добавление строки в DataFrame
frame = frame.append(new_line, ignore_index=True)

In [ ]:
#добавление столбца в DataFrame
frame['IsStudent'] = [False]*5 + [True]*2

In [ ]:
#удаление строк DataFrame
frame.drop([5,6], axis=0)

In [ ]:
#удаление строк DataFrame (inplace)
frame.drop([5,6], axis=0, inplace=True)

In [ ]:
#удаление столбца DataFrame (inplace)
frame.drop('IsStudent', axis=1, inplace=True)

In [ ]:
total_calls = (
    df["Total day calls"]
    + df["Total eve calls"]
    + df["Total night calls"]
    + df["Total intl calls"]
)
df.insert(loc=len(df.columns), column="Total calls", value=total_calls)
# loc parameter is the number of columns after which to insert the Series object
# we set it to len(df.columns) to paste it at the very end of the dataframe


# Или проще:
df["Total charge"] = (
    df["Total day charge"]
    + df["Total eve charge"]
    + df["Total night charge"]
    + df["Total intl charge"]
)

In [ ]:
#запись DataFrame в файл
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=False)

In [134]:
#аналог команды для пользователей Windows
!more dota_hero_stats.csv

,attack_type,id,legs,localized_name,name,primary_attr,roles
0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Initiator']"
4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"
5,Ranged,6,2,Drow Ranger,npc_dota_hero_drow_ranger,agi,"['Carry', 'Disabler', 'Pusher']"
6,Melee,7,2,Earthshaker,npc_dota_hero_earthshaker,str,"['Support', 'Initiator', 'Disabler', 'Nuker']"
7,Melee,8,2,Juggernaut,npc_dota_hero_juggernaut,agi,"['Carry', 'Pusher', 'Escape']"
8,Ranged,9,2,Mirana,npc_dota_hero_mirana,agi,"['Carry', 'Support', 'Escape', 'Nuker', 'Disabler']"
9,Ranged,10,0,Morphling,npc_dota_hero_morphling,agi,"['Carry', 'Escape', 'Durable', 'Nuker', 'Disabler']"
10,Ranged,11,0,Shadow Fiend,npc_dota_hero_nevermore,agi,"['Carry', 'Nuker']"
11,Melee,12,2,Phantom Lancer,npc_dota_hero_phantom_lancer,agi,"['Carry', 'Escape', 'Pusher', 'Nuker']"
12,Ranged,13,2,Puck,npc_dota_hero_puck,int,"['Initiator', 'Disabler', 'Escape', 'Nuker']"
13,Melee,14,2,Pudge,npc_dota_hero_pudge,str,"['Disabler', 'Initiator', 'Durable', 'Nuker']"
14,Ranged,15,0,Razor,npc_dota_hero_razor,agi,"['Carry', 'Durable', 'Nuker', 'Pusher']"
15,Melee,16,6,Sand King,npc_dota_hero_sand_king,str,"['Initiator', 'Disabler', 'Support', 'Nuker', 'Escape', 'Jungler']"
16,Ranged,17,2,Storm Spirit,npc_dota_hero_storm_spirit,int,"['Carry', 'Escape', 'Nuker', 'Initiator', 'Disabler']"
17,Melee,18,2,Sven,npc_dota_hero_sven,str,"['Carry', 'Disabler', 'Initiator', 'Durable', 'Nuker']"
18,Melee,19,2,Tiny,npc_dota_hero_tiny,str,"['Carry', 'Nuker', 'Pusher', 'Initiator', 'Durable', 'Disabler']"
19,Ranged,20,2,Vengeful Spirit,npc_dota_hero_vengefulspirit,agi,"['Support', 'Initiator', 'Disabler', 'Nuker', 'Escape']"
20,Ranged,21,2,Windranger,npc_dota_hero_windrunner,int,"['Carry', 'Support', 'Disabler', 'Escape', 'Nuker']"
21,Ranged,22,2,Zeus,npc_dota_hero_zuus,int,['Nuker']
22,Melee,23,2,Kunkka,npc_dota_hero_kunkka,str,"['Carry', 'Support', 'Disabler', 'Initiator', 'Durable', 'Nuker']"
23,Ranged,25,2,Lina,npc_dota_hero_lina,int,"['Support', 'Carry', 'Nuker', 'Disabler']"
24,Ranged,26,2,Lion,npc_dota_hero_lion,int,"['Support', 'Disabler', 'Nuker', 'Initiator']"
25,Ranged,27,2,Shadow Shaman,npc_dota_hero_shadow_shaman,int,"['Support', 'Pusher', 'Disabler', 'Nuker', 'Initiator']"
26,Melee,28,0,Slardar,npc_dota_hero_slardar,str,"['Carry', 'Durable', 'Initiator', 'Disabler', 'Escape']"
27,Melee,29,2,Tidehunter,npc_dota_hero_tidehunter,str,"['Initiator', 'Durable', 'Disabler', 'Nuker']"
28,Ranged,30,2,Witch Doctor,npc_dota_hero_witch_doctor,int,"['Support', 'Nuker', 'Disabler']"
29,Ranged,31,2,Lich,npc_dota_hero_lich,int,"['Support', 'Nuker']"
30,Melee,32,2,Riki,npc_dota_hero_riki,agi,"['Carry', 'Escape', 'Disabler']"
31,Ranged,33,0,Enigma,npc_dota_hero_enigma,int,"['Disabler', 'Jungler', 'Initiator', 'Pusher']"
32,Ranged,34,2,Tinker,npc_dota_hero_tinker,int,"['Carry', 'Nuker', 'Pusher']"
33,Ranged,35,2,Sniper,npc_dota_hero_sniper,agi,"['Carry', 'Nuker']"
34,Ranged,36,2,Necrophos,npc_dota_hero_necrolyte,int,"['Carry', 'Nuker', 'Durable', 'Disabler']"
35,Ranged,37,2,Warlock,npc_dota_hero_warlock,int,"['Support', 'Initiator', 'Disabler']"
36,Melee,38,2,Beastmaster,npc_dota_hero_beastmaster,str,"['Initiator', 'Disabler', 'Durable', 'Nuker']"
37,Ranged,39,2,Queen of Pain,npc_dota_hero_queenofpain,int,"['Carry', 'Nuker', 'Escape']"
38,Ranged,40,0,Venomancer,npc_dota_hero_venomancer,agi,"['Support', 'Nuker', 'Initiator', 'Pusher', 'Disabler']"
39,Melee,41,2,Faceless Void,npc_dota_hero_faceless_void,agi,"['Carry', 'Initiator', 'Disabler', 'Escape', 'Durable']"
40,Melee,42,2,Wraith King,npc_dota_hero_skeleton_king,str,"['Carry', 'Support', 'Durable', 'Disabler', 'Initiator']"
41,Ranged,43,2,Death Prophet,npc_dota_hero_death_prophet,int,"['Carry', 'Pusher', 'Nuker', 'Disabler']"
42,Melee,44,2,Phantom Assassin,npc_dota_hero_phantom_assassin,agi,"['Carry', 'Escape']"
43,Ranged,45,2,Pugna,npc_dota_hero_pugna,int,"['Nuker', 'Pusher']"
44,Ranged,46,2,Templar Assassin,npc_dota_hero_templar_assassin,agi,"['Carry', 'Escape']"
45,Ranged,47,0,Viper,npc_dota_hero_viper,agi,"['Carry', 'Durable', 'Initiator', 'Disabler']"
46,Ranged,48,2,Luna,npc_dota_hero_luna,agi,"['Carry', 'Nuker', 'Pusher']"
47,Melee,49,2,Dragon Knight,npc_dota_hero_dragon_knight,str,"['Carry', 'Pusher', 'Durable', 'Disabler', 'Initiator', 'Nuker']"
48,Ranged,50,2,Dazzle,npc_dota_hero_dazzle,int,"['Support', 'Nuker', 'Disabler']"
49,Melee,51,2,Clockwerk,npc_dota_hero_rattletrap,str,"['Initiator', 'Disabler', 'Durable', 'Nuker']"
50,Ranged,52,4,Leshrac,npc_dota_hero_leshrac,int,"['Carry', 'Support', 'Nuker', 'Pusher', 'Disabler']"
51,Ranged,53,2,Nature's Prophet,npc_dota_hero_furion,int,"['Carry', 'Jungler', 'Pusher', 'Escape', 'Nuker']"
52,Melee,54,2,Lifestealer,npc_dota_hero_life_stealer,str,"['Carry', 'Durable', 'Jungler', 'Escape', 'Disabler']"
53,Melee,55,2,Dark Seer,npc_dota_hero_dark_seer,int,"['Initiator', 'Jungler', 'Escape', 'Disabler']"
54,Ranged,56,2,Clinkz,npc_dota_hero_clinkz,agi,"['Carry', 'Escape', 'Pusher']"
55,Melee,57,2,Omniknight,npc_dota_hero_omniknight,str,"['Support', 'Durable', 'Nuker']"
56,Ranged,58,4,Enchantress,npc_dota_hero_enchantress,int,"['Support', 'Jungler', 'Pusher', 'Durable', 'Disabler']"
57,Ranged,59,2,Huskar,npc_dota_hero_huskar,str,"['Carry', 'Durable', 'Initiator']"
58,Melee,60,2,Night Stalker,npc_dota_hero_night_stalker,str,"['Carry', 'Initiator', 'Durable', 'Disabler', 'Nuker']"
59,Melee,61,8,Broodmother,npc_dota_hero_broodmother,agi,"['Carry', 'Pusher', 'Escape', 'Nuker']"
60,Melee,62,2,Bounty Hunter,npc_dota_hero_bounty_hunter,agi,"['Escape', 'Nuker']"
61,Ranged,63,4,Weaver,npc_dota_hero_weaver,agi,"['Carry', 'Escape']"
62,Ranged,64,2,Jakiro,npc_dota_hero_jakiro,int,"['Support', 'Nuker', 'Pusher', 'Disabler']"
63,Ranged,65,2,Batrider,npc_dota_hero_batrider,int,"['Initiator', 'Jungler', 'Disabler', 'Escape']"
64,Ranged,66,2,Chen,npc_dota_hero_chen,int,"['Support', 'Jungler', 'Pusher']"
65,Melee,67,0,Spectre,npc_dota_hero_spectre,agi,"['Carry', 'Durable', 'Escape']"
66,Ranged,68,2,Ancient Apparition,npc_dota_hero_ancient_apparition,int,"['Support', 'Disabler', 'Nuker']"
67,Melee,69,2,Doom,npc_dota_hero_doom_bringer,str,"['Carry', 'Disabler', 'Initiator', 'Durable', 'Nuker']"
68,Melee,70,2,Ursa,npc_dota_hero_ursa,agi,"['Carry', 'Jungler', 'Durable', 'Disabler']"
69,Melee,71,2,Spirit Breaker,npc_dota_hero_spirit_breaker,str,"['Carry', 'Initiator', 'Disabler', 'Durable', 'Escape']"
70,Ranged,72,2,Gyrocopter,npc_dota_hero_gyrocopter,agi,"['Carry', 'Nuker', 'Disabler']"
71,Melee,73,2,Alchemist,npc_dota_hero_alchemist,str,"['Carry', 'Support', 'Durable', 'Disabler', 'Initiator', 'Nuker']"
72,Ranged,74,2,Invoker,npc_dota_hero_invoker,int,"['Carry', 'Nuker', 'Disabler', 'Escape', 'Pusher']"
73,Ranged,75,2,Silencer,npc_dota_hero_silencer,int,"['Carry', 'Support', 'Disabler', 'Initiator', 'Nuker']"
74,Ranged,76,4,Outworld Devourer,npc_dota_hero_obsidian_destroyer,int,"['Carry', 'Nuker', 'Disabler']"
75,Melee,77,2,Lycan,npc_dota_hero_lycan,str,"['Carry', 'Pusher', 'Jungler', 'Durable', 'Escape']"
76,Melee,78,2,Brewmaster,npc_dota_hero_brewmaster,str,"['Carry', 'Initiator', 'Durable', 'Disabler', 'Nuker']"
77,Ranged,79,2,Shadow Demon,npc_dota_hero_shadow_demon,int,"['Support', 'Disabler', 'Initiator', 'Nuker']"
78,Ranged,80,2,Lone Druid,npc_dota_hero_lone_druid,agi,"['Carry', 'Pusher', 'Jungler', 'Durable']"
79,Melee,81,2,Chaos Knight,npc_dota_hero_chaos_knight,str,"['Carry', 'Disabler', 'Durable', 'Pusher', 'Initiator']"
80,Melee,82,2,Meepo,npc_dota_hero_meepo,agi,"['Carry', 'Escape', 'Nuker', 'Disabler', 'Initiator', 'Pusher']"
81,Melee,83,2,Treant Protector,npc_dota_hero_treant,str,"['Support', 'Initiator', 'Durable', 'Disabler', 'Escape']"
82,Melee,84,2,Ogre Magi,npc_dota_hero_ogre_magi,int,"['Support', 'Nuker', 'Disabler', 'Durable', 'Initiator']"
83,Melee,85,2,Undying,npc_dota_hero_undying,str,"['Support', 'Durable', 'Disabler', 'Nuker']"
84,Ranged,86,2,Rubick,npc_dota_hero_rubick,int,"['Support', 'Disabler', 'Nuker']"
85,Ranged,87,2,Disruptor,npc_dota_hero_disruptor,int,"['Support', 'Disabler', 'Nuker', 'Initiator']"
86,Melee,88,6,Nyx Assassin,npc_dota_hero_nyx_assassin,agi,"['Disabler', 'Nuker', 'Initiator', 'Escape']"
87,Melee,89,0,Naga Siren,npc_dota_hero_naga_siren,agi,"['Carry', 'Support', 'Pusher', 'Disabler', 'Initiator', 'Escape']"
88,Ranged,90,2,Keeper of the Light,npc_dota_hero_keeper_of_the_light,int,"['Support', 'Nuker', 'Disabler', 'Jungler']"
89,Ranged,91,0,Io,npc_dota_hero_wisp,str,"['Support', 'Escape', 'Nuker']"
90,Ranged,92,2,Visage,npc_dota_hero_visage,int,"['Support', 'Nuker', 'Durable', 'Disabler', 'Pusher']"
91,Melee,93,2,Slark,npc_dota_hero_slark,agi,"['Carry', 'Escape', 'Disabler', 'Nuker']"
92,Ranged,94,0,Medusa,npc_dota_hero_medusa,agi,"['Carry', 'Disabler', 'Durable']"
93,Ranged,95,2,Troll Warlord,npc_dota_hero_troll_warlord,agi,"['Carry', 'Pusher', 'Disabler', 'Durable']"
94,Melee,96,4,Centaur Warrunner,npc_dota_hero_centaur,str,"['Durable', 'Initiator', 'Disabler', 'Nuker', 'Escape']"
95,Melee,97,4,Magnus,npc_dota_hero_magnataur,str,"['Initiator', 'Disabler', 'Nuker', 'Escape']"
96,Melee,98,2,Timbersaw,npc_dota_hero_shredder,str,"['Nuker', 'Durable', 'Escape']"
97,Melee,99,2,Bristleback,npc_dota_hero_bristleback,str,"['Carry', 'Durable', 'Initiator', 'Nuker']"
98,Melee,100,2,Tusk,npc_dota_hero_tusk,str,"['Initiator', 'Disabler', 'Nuker']"
99,Ranged,101,2,Skywrath Mage,npc_dota_hero_skywrath_mage,int,"['Support', 'Nuker', 'Disabler']"
100,Melee,102,2,Abaddon,npc_dota_hero_abaddon,str,"['Support', 'Carry', 'Durable']"
101,Melee,103,2,Elder Titan,npc_dota_hero_elder_titan,str,"['Initiator', 'Disabler', 'Nuker', 'Durable']"
102,Melee,104,2,Legion Commander,npc_dota_hero_legion_commander,str,"['Carry', 'Disabler', 'Initiator', 'Durable', 'Nuker']"
103,Ranged,105,6,Techies,npc_dota_hero_techies,int,"['Nuker', 'Disabler']"
104,Melee,106,2,Ember Spirit,npc_dota_hero_ember_spirit,agi,"['Carry', 'Escape', 'Nuker', 'Disabler', 'Initiator']"
105,Melee,107,2,Earth Spirit,npc_dota_hero_earth_spirit,str,"['Nuker', 'Escape', 'Disabler', 'Initiator', 'Durable']"
106,Melee,108,2,Underlord,npc_dota_hero_abyssal_underlord,str,"['Support', 'Nuker', 'Disabler', 'Durable', 'Escape']"
107,Melee,109,2,Terrorblade,npc_dota_hero_terrorblade,agi,"['Carry', 'Pusher', 'Nuker']"
108,Ranged,110,2,Phoenix,npc_dota_hero_phoenix,str,"['Support', 'Nuker', 'Initiator', 'Escape', 'Disabler']"
109,Ranged,111,2,Oracle,npc_dota_hero_oracle,int,"['Support', 'Nuker', 'Disabler', 'Escape']"
110,Ranged,112,2,Winter Wyvern,npc_dota_hero_winter_wyvern,int,"['Support', 'Disabler', 'Nuker']"
111,Ranged,113,2,Arc Warden,npc_dota_hero_arc_warden,agi,"['Carry', 'Escape', 'Nuker']"
112,Melee,114,2,Monkey King,npc_dota_hero_monkey_king,agi,"['Carry', 'Escape', 'Disabler', 'Initiator']"
113,Ranged,119,2,Dark Willow,npc_dota_hero_dark_willow,int,"['Support', 'Nuker', 'Disabler', 'Escape']"
114,Melee,120,2,Pangolier,npc_dota_hero_pangolier,agi,"['Carry', 'Nuker', 'Disabler', 'Durable', 'Escape', 'Initiator']"
115,Ranged,121,2,Grimstroke,npc_dota_hero_grimstroke,int,"['Support', 'Nuker', 'Disabler', 'Escape']"
116,Melee,129,2,Mars,npc_dota_hero_mars,str,"['Carry', 'Initiator', 'Disabler', 'Durable']"

# Groupby, Aggregate, Pivot_table
In general, grouping data in Pandas works as follows:

df.groupby(by=grouping_columns)[columns_to_show].function()

First, the groupby method divides the grouping_columns by their values. They become a new index in the resulting dataframe.

Then, columns of interest are selected (columns_to_show). If columns_to_show is not included, all non groupby clauses will be included.

Finally, one or several functions are applied to the obtained groups per selected columns.

In [14]:
dota = pd.read_csv('dota_hero_stats.csv')

In [46]:
dota.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

In [132]:
dota.describe(include=["object", 'bool']) # Опишем столбцы с нечисловыми данными

,attack_type,localized_name,name,primary_attr,roles
count,117,117,117,117,117
unique,2,117,117,3,100
top,Ranged,Arc Warden,npc_dota_hero_weaver,int,"['Support', 'Disabler', 'Nuker']"
freq,61,1,1,42,3

In [133]:
dota.sort_values(by=["legs", "id"], ascending=[True, False]).head() #Сортировка

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles,roles_count
92,92,Ranged,94,0,Medusa,npc_dota_hero_medusa,agi,"['Carry', 'Disabler', 'Durable']",3
89,89,Ranged,91,0,Io,npc_dota_hero_wisp,str,"['Support', 'Escape', 'Nuker']",3
87,87,Melee,89,0,Naga Siren,npc_dota_hero_naga_siren,agi,"['Carry', 'Support', 'Pusher', 'Disabler', 'In...",6
65,65,Melee,67,0,Spectre,npc_dota_hero_spectre,agi,"['Carry', 'Durable', 'Escape']",3
45,45,Ranged,47,0,Viper,npc_dota_hero_viper,agi,"['Carry', 'Durable', 'Initiator', 'Disabler']",4

In [47]:
dota['roles_count'] = [len(roo[1:-2].split(',')) for roo in dota['roles']] #посчитаем количество ролей

In [48]:
dota['roles_count'].mode() #Самое частое количество ролей

0    4
dtype: int64

In [123]:
dota["legs"].value_counts()    #посчитаем польователей с разным количеством ног

2    95
0    11
4     7
6     3
8     1
Name: legs, dtype: int64

In [127]:
dota["legs"].value_counts(normalize = True) # И в процентах

2    0.811966
0    0.094017
4    0.059829
6    0.025641
8    0.008547
Name: legs, dtype: float64

In [19]:
num_legs = dota[dota['legs'] == 4].shape[0] # корректный подсчет записей с определенным значением в определенном столбце

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
50,50,Ranged,52,4,Leshrac,npc_dota_hero_leshrac,int,"['Carry', 'Support', 'Nuker', 'Pusher', 'Disab..."
56,56,Ranged,58,4,Enchantress,npc_dota_hero_enchantress,int,"['Support', 'Jungler', 'Pusher', 'Durable', 'D..."
61,61,Ranged,63,4,Weaver,npc_dota_hero_weaver,agi,"['Carry', 'Escape']"
74,74,Ranged,76,4,Outworld Devourer,npc_dota_hero_obsidian_destroyer,int,"['Carry', 'Nuker', 'Disabler']"
94,94,Melee,96,4,Centaur Warrunner,npc_dota_hero_centaur,str,"['Durable', 'Initiator', 'Disabler', 'Nuker', ..."
95,95,Melee,97,4,Magnus,npc_dota_hero_magnataur,str,"['Initiator', 'Disabler', 'Nuker', 'Escape']"

In [6]:
dota[['attack_type', 'primary_attr']].pivot_table(index = 'attack_type', columns = 'primary_attr', 
                                                  aggfunc = len) #найдем самое частое сочетание оружия + атрибут (сводная)

primary_attr  agi  int  str
attack_type
Melee          19    2   35
Ranged         18   40    3

In [50]:
pd.crosstab(dota['attack_type'], dota["primary_attr"]) # то же самое через crosstab

primary_attr  agi  int  str
attack_type
Melee          19    2   35
Ranged         18   40    3

In [52]:
pd.crosstab(dota['attack_type'], dota["primary_attr"], normalize = True, margins = True) # и в процентах

primary_attr       agi       int       str       All
attack_type
Melee         0.162393  0.017094  0.299145  0.478632
Ranged        0.153846  0.341880  0.025641  0.521368
All           0.316239  0.358974  0.324786  1.000000

# Melt и Pivot - reshaping

In [4]:
# Создадим DataFrame
di = {
    'Day': ['MON', 'TUE', 'WEN', 'THU', 'FRI'],
    'Google': [1129, 1132, 1134, 1152, 1152],
    'Apple': [191, 192, 190, 190, 188]
}
df = pd.DataFrame(di)
df

   Day  Google  Apple
0  MON    1129    191
1  TUE    1132    192
2  WEN    1134    190
3  THU    1152    190
4  FRI    1152    188

In [6]:
# Сольем из ширины в глубину, оставив нетронутой колону 'Day' (id_vars)
# Сразу переименуем новые столбцы (var_name, value_name)
new_df = df.melt(id_vars = 'Day', var_name = 'Company', value_name = 'Price')
new_df

   Day Company  Price
0  MON  Google   1129
1  TUE  Google   1132
2  WEN  Google   1134
3  THU  Google   1152
4  FRI  Google   1152
5  MON   Apple    191
6  TUE   Apple    192
7  WEN   Apple    190
8  THU   Apple    190
9  FRI   Apple    188

In [16]:
# Обратный reshape - Pivot, оставив нетронутой колонку 'Day' (index)
# Используем в качестве колонок таблицы значения "Company" ('columns')
orig_df = new_df.pivot_table(index = 'Day', columns = 'Company')
orig_df

        Price
Company Apple Google
Day
FRI       188   1152
MON       191   1129
THU       190   1152
TUE       192   1132
WEN       190   1134

In [17]:
# Подкорректируем структуру, убрав обощающий столбец и лишнее название
orig_df = new_df.pivot_table(index = 'Day', columns = 'Company')['Price'].reset_index()
orig_df.columns.name = None 
orig_df

   Day  Apple  Google
0  FRI    188    1152
1  MON    191    1129
2  THU    190    1152
3  TUE    192    1132
4  WEN    190    1134

# Merge и map - добавление столбцов из датафреймов и словарей

In [ ]:
# Из задачи яндекса про запросы URL - слияние несколькими датафреймов по одному id
rating = rating.merge(host, on = 'url')

# pValues - словать с ключами, совпадающими со столбцом 'id' в датафрейме query
query['pvalue'] = query['id'].map(pValues)

# Удаляем дупликаты в той же задаче. Предварительно отсортировать!
rating = rating.drop_duplicates(subset = ['id', 'host_id'])

# Делаем второй столбец из превого сдвигом (чтобы использовать значение в специфичной формуле)
a['rev_rel'] = a['relevance'].shift(periods = 1, axis = 0, fill_value = 1)

#Специфичная формула с отсылкой на прошлую строку - через цикл и iloc
for i in range(1, len(a)):
        a.iloc[i, 4] = a.iloc[i-1, 4] * (1 - a.iloc[i-1, 2]) * 0.85

# idxmin, idxmax, ne, nsmallest, nlargest - поиск и отбор максимумов и минимумов, ненулевых элементов

Вернем индекс максимального и минимального элемента в pd Series (первое вхождение)

In [22]:
orig_df['Google'].idxmin()

1

In [23]:
orig_df['Apple'].idxmax()

3

И то же самое для DataFrame с несколькими столбцами

In [28]:
orig_df[['Google', 'Apple']].idxmax()

Google    0
Apple     3
dtype: int64

Поработаем с отбором (ne)

In [32]:
di2 = {
    'Day': [1, 2, 3, 4, 5, 6, 7],
    'Usage': [0, 0, 0, 3, 2, 5, 6]
}
usage = pd.DataFrame(di2)
usage

   Day  Usage
0    1      0
1    2      0
2    3      0
3    4      3
4    5      2
5    6      5
6    7      6

In [37]:
#булевый вектор
usage['Usage'].ne(0)

0    False
1    False
2    False
3     True
4     True
5     True
6     True
Name: Usage, dtype: bool

In [36]:
usage['Usage'].ne(0).idxmax()  #Узнаем позицию первого ненулевого элемента (т.к. True > False это первое вхождение масимума)

3

In [39]:
usage.loc[usage['Usage'].ne(0).idxmax():]  #Отберем все строки, начиная с первого ненулевого ипользования

   Day  Usage
3    4      3
4    5      2
5    6      5
6    7      6

# nsmallest, nlargest - отбор  строк с лидирующими значениями

In [40]:
# Отберем 3 строки с минимальным Usage
usage.nsmallest(3, 'Usage')

   Day  Usage
0    1      0
1    2      0
2    3      0

In [41]:
# Отберем 3 строки с максимальным Usage
usage.nlargest(3, 'Usage')

   Day  Usage
6    7      6
5    6      5
3    4      3

In [43]:
# Отберем 3 строки с минимальным Usage кроме нулевых
usage.loc[usage['Usage'].ne(0).idxmax():].nsmallest(3, 'Usage')

   Day  Usage
4    5      2
3    4      3
5    6      5

# groupby и aggregate - продвинутая группировка и аггрегация

In [7]:
iris = pd.read_csv('iris.data', header = None, names = ['sepalLength', 'sepalWidth', 'petalLength', 'petalWidth', 'class'])

In [8]:
iris['class'] = [name[5:] for name in iris['class']]  # преобразуем значения классов

In [9]:
iris

     sepalLength  sepalWidth  petalLength  petalWidth      class
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

Посмотрим способы нахождения максимальных и минимальных значений по определенному столбцу датафрейма, группируя по другому столбцу

In [105]:
iris.groupby('class').max()[['sepalLength']]

            sepalLength
class
setosa              5.8
versicolor          7.0
virginica           7.9

In [44]:
iris.groupby('class')[['sepalLength']].max()  # эквивалентно предыдущей записи

            sepalLength
class
setosa              5.8
versicolor          7.0
virginica           7.9

In [107]:
iris.groupby('class').sepalLength.agg(
    maxSepalLength  = 'max',
    minSepalLength  = 'min')

            maxSepalLength  minSepalLength
class
setosa                 5.8             4.3
versicolor             7.0             4.9
virginica              7.9             4.9

In [112]:
iris.groupby('class').sepalLength.agg('max')

class
setosa        5.8
versicolor    7.0
virginica     7.9
Name: sepalLength, dtype: float64

In [116]:
iris.groupby('class').sepalLength.agg([
    lambda x: x.max(), 
    lambda x: x.min(),
    lambda x: x.mean()
    ])

            <lambda_0>  <lambda_1>  <lambda_2>
class
setosa             5.8         4.3       5.006
versicolor         7.0         4.9       5.936
virginica          7.9         4.9       6.588

Посмотрим аггрегацию сразу нескольких столбцов

In [118]:
iris.groupby('class').agg(
    maxSepalLength = pd.NamedAgg(column = 'sepalLength', aggfunc = 'max'),
    minSepalLength = pd.NamedAgg(column = 'sepalLength', aggfunc = 'min'),
    maxSepalWidth = pd.NamedAgg(column = 'sepalWidth', aggfunc = 'max'),
    minSepalWidth = pd.NamedAgg(column = 'sepalWidth', aggfunc = 'min'),
    maxPetalLength = pd.NamedAgg(column = 'petalLength', aggfunc = 'max'),
    minPetalLength = pd.NamedAgg(column = 'petalLength', aggfunc = 'min'),
    maxPetalWidth = pd.NamedAgg(column = 'petalWidth', aggfunc = 'max'),
    minPetalWidth = pd.NamedAgg(column = 'petalWidth', aggfunc = 'min'),
    )

,maxSepalLength,minSepalLength,maxSepalWidth,minSepalWidth,maxPetalLength,minPetalLength,maxPetalWidth,minPetalWidth
class,,,,,,,,
setosa,5.8,4.3,4.4,2.3,1.9,1.0,0.6,0.1
versicolor,7.0,4.9,3.4,2.0,5.1,3.0,1.8,1.0
virginica,7.9,4.9,3.8,2.2,6.9,4.5,2.5,1.4

In [121]:
iris.groupby('class').agg([
    lambda x: x.max(),
    lambda x: x.min()
    ])

           sepalLength            sepalWidth            petalLength  \
            <lambda_0> <lambda_1> <lambda_0> <lambda_1>  <lambda_0>
class
setosa             5.8        4.3        4.4        2.3         1.9
versicolor         7.0        4.9        3.4        2.0         5.1
virginica          7.9        4.9        3.8        2.2         6.9

                      petalWidth
           <lambda_1> <lambda_0> <lambda_1>
class
setosa            1.0        0.6        0.1
versicolor        3.0        1.8        1.0
virginica         4.5        2.5        1.4

In [ ]:
# Из яндекса контеста - подсчет уникльных и их количества
info = data.groupby(0)['correct_phone'].nunique()

### Преобразование типов столбцов

In [22]:
iris["sepalLength_int"] = iris["sepalLength"].astype("int64") # Преобразуем к типу int

In [23]:
iris

,sepalLength,sepalWidth,petalLength,petalWidth,class,sepalLength_int
0,5.1,3.5,1.4,0.2,setosa,5
1,4.9,3.0,1.4,0.2,setosa,4
2,4.7,3.2,1.3,0.2,setosa,4
3,4.6,3.1,1.5,0.2,setosa,4
4,5.0,3.6,1.4,0.2,setosa,5
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,6
146,6.3,2.5,5.0,1.9,virginica,6
147,6.5,3.0,5.2,2.0,virginica,6
148,6.2,3.4,5.4,2.3,virginica,6
149,5.9,3.0,5.1,1.8,virginica,5

In [28]:
iris.dtypes

sepalLength        float64
sepalWidth         float64
petalLength        float64
petalWidth         float64
class               object
sepalLength_int      int64
dtype: object

In [ ]:
#изменение типа столбца с помощью функции apply - взяла из другого файла
frame.Birth = frame.Birth.apply(pd.to_datetime)

#заполнение na
frame.fillna('разнорабочий', inplace=True)

frame[:3] #выбираем первые три записи
frame[-3:] #выбираем три послдение записи

frame.loc[[0,1,2], ["Name", "City"]] #работает на основе имен
frame.iloc[[1,3,5], [0,1]] #работает на основе позиций

# diff - функция разницы с прошлой строкой. Можно в groupby()!
#### timedelta перевод в секунды

In [ ]:
data['diff'] = data['date'].diff()
data['diff_in_min'] = data['diff'].apply(lambda x: x.total_seconds() / 60)

## Оконные функции. Временные ряды, кумулятивная сумма и подсчет

In [37]:
data = pd.read_csv('log.csv')
data.head()

                  date    user  event_type parameter
0  2020-04-01_00:04:03  976455           3       NaN
1  2020-04-01_00:01:27  456430           3      text
2  2020-04-01_00:06:32  566998           1   unknown
3  2020-04-01_00:08:28  927997           3       NaN
4  2020-04-01_00:08:53  237940           4   unknown

In [38]:
# приведем дату и время к правильному формату datetime . (Возможно стоило бы сразу сделать Parse_datetime)
data['date'] = data.date.apply(pd.to_datetime, format = '%Y-%m-%d_%H:%M:%S')

In [39]:
# отсортируем по времени
data.sort_values(by = 'date', inplace = True)
# вынесем время в индекс датафрейма
data.set_index('date', inplace = True)

Наша задача - найти самый поздний пятиминутный интервал с максимальным количеством событий (левая граница включена, правая нет). В ответе вывести его начало.

Для быстрого решения нужно воспользоваться оконной функцией библиотеки pandas rolling() с временным окном в 5 минут.

In [44]:

# indexer = pd.api.indexers.FixedForwardWindowIndexer(window_size=2) # Вперед мотрящее окно бывает только
# фиксированного размера

# data['user'].rolling(window='1h').count() # смотрит назад. К сожалению, окно с временной периодичностью
# умеет смотреть только назад. А нам надо вперед на 5 минут!

# сделать колону time + 5 min - это бесползено, смотреть все равно будет назад.


# Решение: реверсируем массив, чтобы мы смотрели не назад, а вперед при подсчетах


event_cnt = data['user'][::-1].rolling(window = '5min', closed = 'left').count()

In [51]:
# добавим столбец в датафрейм если нужно
data['counted'] = event_cnt[::-1]

# посчитаем максимум и найдем время начало интервала
max_users = event_cnt.max()
print(max_users)
event_cnt[event_cnt == max_users].index.max()

73.0

Timestamp('2020-04-09 13:06:42')

#### Из упражнений по pandas

In [53]:
# Название всех колонок
data.columns.to_list()

['user', 'event_type', 'parameter', 'counted']

In [66]:
# Тип данных первой колонки
data.dtypes[1]

dtype('int64')

In [73]:
# какая индексация у датафрейма
data.index

DatetimeIndex(['2020-04-01 00:01:27', '2020-04-01 00:04:03',
               '2020-04-01 00:06:32', '2020-04-01 00:08:28',
               '2020-04-01 00:08:53', '2020-04-01 00:09:50',
               '2020-04-01 00:15:25', '2020-04-01 00:15:36',
               '2020-04-01 00:16:50', '2020-04-01 00:20:51',
               ...
               '2020-04-30 23:57:29', '2020-04-30 23:58:03',
               '2020-04-30 23:58:13', '2020-04-30 23:58:30',
               '2020-04-30 23:58:38', '2020-04-30 23:58:43',
               '2020-04-30 23:59:05', '2020-04-30 23:59:05',
               '2020-04-30 23:59:32', '2020-04-30 23:59:43'],
              dtype='datetime64[ns]', name='date', length=200000, freq=None)

In [71]:
# значение в ячейке

data.iloc[20,2]

#либо

data.values[20][2]

'unknown'

## Как дозаполнять датафреймы
### Из Yandex Cup RecSys: строим матрицу признаков при недостатке отзывов от юзеров.

In [2]:
import pandas as pd
import numpy as np

In [30]:
df_one = pd.DataFrame({'user_id': [101, 102, 103, 104], '201': [1, 1, 0, 0], '203': [0, 0, 1, 0]})
user_ids = [101, 102, 103, 104, 105]
org_ids = ['201', '202', '203', '204', '205']  # ВАЖНО ЧТО ЭТО STRING, ЧТОБЫ СОВПАЛИ КОЛОНКИ
zeros = pd.DataFrame({'user_id': user_ids})
zeros[org_ids] = pd.DataFrame(np.zeros((len(user_ids), len(org_ids))))
zeros.set_index(keys = 'user_id', inplace = True)
df_one.set_index(keys = 'user_id', inplace = True)

In [25]:
df_one

         201  203
user_id
101        1    0
102        1    0
103        0    1
104        0    0

In [26]:
zeros

         201  202  203  204  205
user_id
101      0.0  0.0  0.0  0.0  0.0
102      0.0  0.0  0.0  0.0  0.0
103      0.0  0.0  0.0  0.0  0.0
104      0.0  0.0  0.0  0.0  0.0
105      0.0  0.0  0.0  0.0  0.0

In [33]:
answer = zeros.add(df_one, axis = 0, fill_value = 0).astype('int')

In [34]:
answer

         201  202  203  204  205
user_id
101        1    0    0    0    0
102        1    0    0    0    0
103        0    0    1    0    0
104        0    0    0    0    0
105        0    0    0    0    0